wurh0001/STM32F103C8T6projects/aht10温度传感器/System/MyI2C.c
/**
 * @FilePath     : /aht10温度传感器/System/MyI2C.c
 * @Description  :  SCL引脚为PB10，SDA引脚为PB11
 *                 本文件中的函数用于I2C总线的初始化、起始信号、停止信号、发送字节、接收字节、发送应答、接收应答
 * @Author       : wuu
 * @Date         : 2024-01-29 21:37:41
 * @Version      : 0.0.1
 * @LastEditTime : 2024-01-29 21:59:59
 * @Copyright    : G AUTOMOBILE RESEARCH INSTITUTE CO.,LTD Copyright (c) 2024.
**/

#include "stm32f10x.h"
#include "Delay.h"
#include "MyI2C.h"

/**
 * @brief        : 用于设置I2C的SCL引脚电平
 * @param         {uint8_t} BitValue:可输入值为0或1
 * @return        {*}
**/
void MyI2C_W_SCL(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
	DelayUs(10);
}

/**
 * @brief        : 用于设置I2C的SDA引脚电平
 * @param         {uint8_t} BitValue:可输入值为0或1
 * @return        {*}
**/
void MyI2C_W_SDA(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
	DelayUs(10);
}

/**
 * @brief        : 用于读取I2C的SDA引脚电平
 * @return        {BitValue} 返回值为0或1
**/
uint8_t MyI2C_R_SDA(void)
{
	uint8_t BitValue;
	BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
	DelayUs(10);
	return BitValue;
}

void MyI2C_Init(void)
{
    // 使能GPIOB时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
    // 设置I2C的SCL和SDA引脚为高电平
	GPIO_SetBits(GPIOB, GPIO_Pin_10 | GPIO_Pin_11);
}

void MyI2C_Start(void)
{
	MyI2C_W_SDA(1);
	MyI2C_W_SCL(1);
	MyI2C_W_SDA(0);
	MyI2C_W_SCL(0);
}

void MyI2C_Stop(void)
{
	MyI2C_W_SDA(0);
	MyI2C_W_SCL(1);
	MyI2C_W_SDA(1);
}

void MyI2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i ++)
	{
		MyI2C_W_SDA(Byte & (0x80 >> i));
		MyI2C_W_SCL(1);
		MyI2C_W_SCL(0);
	}
}

uint8_t MyI2C_ReceiveByte(void)
{
	uint8_t i, Byte = 0x00;
	MyI2C_W_SDA(1);
	for (i = 0; i < 8; i ++)
	{
		MyI2C_W_SCL(1);
		if (MyI2C_R_SDA() == 1){Byte |= (0x80 >> i);}
		MyI2C_W_SCL(0);
	}
	return Byte;
}

void MyI2C_SendAck(uint8_t AckBit)
{
	MyI2C_W_SDA(AckBit);
	MyI2C_W_SCL(1);
	MyI2C_W_SCL(0);
}

uint8_t MyI2C_ReceiveAck(void)
{
	uint8_t AckBit;
	MyI2C_W_SDA(1);
	MyI2C_W_SCL(1);
	AckBit = MyI2C_R_SDA();
	MyI2C_W_SCL(0);
	return AckBit;
}
